Repository: koreader/koreader
Catalog: l10n/*/koreader.po
Languages: cs_cz

source: -d start in debug mode
cs_cz: -d spustit v režimu ladění

source: -h show this usage help
cs_cz: -h zobrazit nápovědu

source: -p [rows] enable Lua code profiling
cs_cz: -p [řádky] umožnit profiling Lua kódu

source: 0 deg
cs_cz: 0 stupňů

source: 10 deg
cs_cz: 10 stupňů

source: 5 deg
cs_cz: 5 stupňů

source: Add Note
cs_cz: Přidat poznámku

source: Apply
cs_cz: Použít

source: Auto Straighten
cs_cz: Automatické narovnání

source: Auto-detected Kindle 2
cs_cz: Detekován Kindle 2

source: Auto-detected Kindle 3
cs_cz: Detekován Kindle 3

source: Auto-detected Kindle 4
cs_cz: Detekován Kindle 4

source: Auto-detected Kindle DXG
cs_cz: Detekován Kindle DXG

source: Auto-detected Kindle PaperWhite
cs_cz: Detekován Kindle PaperWhite

source: Auto-detected Kindle Touch
cs_cz: Detekován Kindle Touch

source: Auto-detected Kobo
cs_cz: Detekováno Kobo

source: Bookmarks
cs_cz: Záložky

source: Cancel
cs_cz: Zrušit

source: Change Hyphenation to
cs_cz: Změna slovníku pro dělení slov na

source: Change font
cs_cz: Změnit písmo

source: Columns
cs_cz: Sloupce

source: Contrast
cs_cz: Kontrast

source: Copy
cs_cz: Kopírovat

source: Cut
cs_cz: Vystřihnout

source: Decrease front light intensity to
cs_cz: Snížit úroveň osvětlení na

source: Decrease gamma to
cs_cz: Snížit gamu na

source: Decrease line space to
cs_cz: Snížit rozteč řádků na

source: Defect Size
cs_cz: Neplatná velikost

source: Delete
cs_cz: Smazat

source: Device model=
cs_cz: Model zařízení=

source: Document Language
cs_cz: Jazyk dokumentu

source: Document menu
cs_cz: Menu dokumentu

source: Edit
cs_cz: Editovat

source: Embedded style
cs_cz: Vložený styl

source: File does not exist
cs_cz: Soubor neexistuje

source: File manager menu
cs_cz: Menu správce souborů

source: FileManager
cs_cz: Správce souborů

source: Fine Tuning
cs_cz: Jemné ladění

source: Firmware revision
cs_cz: Revize firmwaru

source: Font weight
cs_cz: Tloušťka písma

source: Frontlight Level
cs_cz: Úroveň osvětlení

source: Frontlight settings
cs_cz: Nastavení osvětlení

source: Full Screen
cs_cz: Celá obrazovka

source: Gamma
cs_cz: Gama

source: Go To
cs_cz: Jít na

source: Go to Page or Location
cs_cz: Jít na stránku nebo pozici

source: Help
cs_cz: Nápověda

source: Highlight
cs_cz: Zvýraznění

source: History
cs_cz: Historie

source: Hyphenation
cs_cz: Dělení slov

source: If you don't pass any path, the last viewed document will be opened
cs_cz: Pokud nezadáte jinou cestu, bude otevřen naposled zobrazený dokument

source: If you give the name of a directory instead of a file path, a file
cs_cz: Zadáte-li jméno adresáře místo cesty k souboru, soubor

source: Increase front light intensity to
cs_cz: Zvýšit úroveň osvětlení na

source: Increase gamma to
cs_cz: Zvýšit gamu na

source: Increase line space to
cs_cz: Zvýšit rozteč řádků na

source: Indentation
cs_cz: Odsazení

source: Invert
cs_cz: Invertovat

source: Language
cs_cz: Jazyk

source: Lighten
cs_cz: Zesvětlit

source: Line Spacing
cs_cz: Řádkování

source: Location
cs_cz: Pozice

source: More
cs_cz: Více

source: No reader engine for this file
cs_cz: Engine pro tento soubor nenalezen

source: Not supported device model!
cs_cz: Nepodporovaný typ zařízení!

source: Page
cs_cz: Stránka

source: Page
cs_cz: Stránka

source: Page Crop
cs_cz: Oříznout stránku

source: Page Margin
cs_cz: Okraje stránky

source: Paste
cs_cz: Vložit

source: Please report bugs to https://github.com/koreader/ koreader/issues, Click at the bottom of the page for more options
cs_cz: Prosím chyby hlašte na https://github.com/koreader/ koreader/issues, klikněte na horní okraj pro více voleb

source: Please restart reader for new language setting to take effect.
cs_cz: Restartujte prosím KOReader, aby se změna jazyka projevila.

source: Read all the books on your E-Ink reader
cs_cz: A přečtete všechny knihy na vaší čtečce

source: Redrawing with font
cs_cz: Překresluji s písmem

source: Reflow
cs_cz: Přeformátování (reflow)

source: Render Quality
cs_cz: Kvalita vykreslení

source: Screen Mode
cs_cz: Režim zobrazení

source: Screen height =
cs_cz: Výška displeje =

source: Screen width =
cs_cz: Šířka displeje =

source: Scroll Mode
cs_cz: Režim posouvání

source: See http://github.com/koreader/kindlepdfviewer for more info.
cs_cz: Navštivte http://github.com/koreader/kindlepdfviewer pro více informací.

source: Select Menu Item
cs_cz: Vyberte položku menu

source: Select Option Item
cs_cz: Vyberte volbu

source: Set font size to
cs_cz: Nastavit velikost písma na

source: Set highlight drawer
cs_cz: Způsob zvýraznění

source: Set render style
cs_cz: Nastavit způsob vykreslování

source: Share
cs_cz: Sdílet

source: Standby
cs_cz: Uspávám

source: Switch zoom mode
cs_cz: Režim zvětšení

source: Table of Contents
cs_cz: Obsah

source: Table of contents
cs_cz: Obsah

source: Tap Button
cs_cz: Klikněte na tlačítko

source: Text Align
cs_cz: Zarovnání textu

source: This software is licensed under the GPLv3.
cs_cz: Tento software podléhá licenci GPLv3.

source: Toggle
cs_cz: Přepnout

source: Toggle hidden files
cs_cz: Přepnout zobrazování skrytých souborů

source: Toggle switch
cs_cz: Přepínač

source: Translate
cs_cz: Přeložit

source: Turn off floating punctuation
cs_cz: Vypnout plovoucí interpunkci

source: Turn off page overlap
cs_cz: Vypnout překrývání stránek

source: Turn on floating punctuation
cs_cz: Zapnout plovoucí interpunkci

source: Turn on page overlap
cs_cz: Zapnout překrývání stránek

source: Underscore
cs_cz: Podtrhnout

source: Version
cs_cz: Verze

source: Vertical Text
cs_cz: Svislý text

source: View mode
cs_cz: Režim náhledu

source: Word Gap
cs_cz: Mezery mezi slovy

source: Writing Direction
cs_cz: Směr psaní

source: Writing screen to
cs_cz: Ukládám snímek do

source: Zoom to fit content
cs_cz: Zvětšit podle obsahu

source: Zoom to fit content height
cs_cz: Zvětšit na výšku obsahu

source: Zoom to fit content width
cs_cz: Zvětšit na šířku obsahu

source: Zoom to fit page
cs_cz: Zvětšit na stránku

source: Zoom to fit page height
cs_cz: Zvětšit na výšku stránky

source: Zoom to fit page width
cs_cz: Zvětšit na šířku stránky

source: cancel
cs_cz: zrušit

source: chooser will show up and let you select a file
cs_cz: zobrazí se dialog, jenž umožní výběr souboru

source: chose selected item
cs_cz: zvolena vybraná položka

source: chose selected option
cs_cz: zvolena vybraná volba

source: clear all external styles
cs_cz: vyčistit všechny externí styly

source: close config menu
cs_cz: zavřít nastavení

source: close dialog
cs_cz: zavřít dialog

source: close document
cs_cz: zavřít dokument

source: close menu
cs_cz: zavřít menu

source: darker
cs_cz: tmavý

source: darkest
cs_cz: nejtmavší

source: decrease
cs_cz: snížit

source: decrease font size
cs_cz: zmenšit velikost písma

source: decrease line space
cs_cz: zmenšit řádkování

source: default
cs_cz: výchozí

source: go to 11%
cs_cz: jít na 11%

source: go to 22%
cs_cz: jít na 22%

source: go to 33%
cs_cz: jít na 33%

source: go to 44%
cs_cz: jít na 44%

source: go to 55%
cs_cz: jít na 55%

source: go to 66%
cs_cz: jít na 66%

source: go to 77%
cs_cz: jít na 77%

source: go to 88%
cs_cz: jít na 88%

source: go to end
cs_cz: jít na konec

source: go to next view
cs_cz: jít na další pohled

source: go to previous view
cs_cz: jít na předešlý pohled

source: go to start
cs_cz: jít na začátek

source: goto next page of the menu
cs_cz: jít na další stránku menu

source: goto previous page of the menu
cs_cz: jít na předešlou stránku menu

source: high
cs_cz: vysoká

source: highlight text
cs_cz: zvýraznit text

source: increase
cs_cz: zvýšit

source: increase font size
cs_cz: zvětšit velikost písma

source: increase line space
cs_cz: zvětšit řádkování

source: landscape
cs_cz: na šířku

source: large
cs_cz: velké

source: lighter
cs_cz: světlejší

source: lightest
cs_cz: nejsvětlejší

source: low
cs_cz: nízká

source: manual
cs_cz: ručně

source: medium
cs_cz: střední

source: move view down
cs_cz: posunout pohled dolů

source: move view up
cs_cz: posunout pohled nahoru

source: move visible area down
cs_cz: posunout viditelnou oblast dolů

source: move visible area left
cs_cz: posunout viditelnou oblast doleva

source: move visible area right
cs_cz: posunout viditelnou oblast doprava

source: move visible area up
cs_cz: posunout viditelnou oblast nahoru

source: no choices available
cs_cz: nejsou dostupné žádné volby

source: no text
cs_cz: žádný text

source: off
cs_cz: vypnout

source: on
cs_cz: zapnout

source: opening file
cs_cz: otevírám soubor

source: page
cs_cz: stránka

source: page
cs_cz: stránka

source: portrait
cs_cz: na šířku

source: rotate left by 90 degrees
cs_cz: otočit doleva o 90 stupňů

source: rotate right by 90 degrees
cs_cz: otočit doprava o 90 stupňů

source: scroll
cs_cz: posuv

source: select current menu item
cs_cz: vybrat aktuální položku menu

source: semi-auto
cs_cz: polo-auto

source: show Table of Content menu
cs_cz: zobrazit menu pro Obsah

source: show bookmarks
cs_cz: zobrazit záložky

source: show config dialog
cs_cz: zobrazit konfigurační dialog

source: show font menu
cs_cz: zobrazit menu pro písmo

source: show menu
cs_cz: zobrazit menu

source: small
cs_cz: malé

source: toggle bold
cs_cz: tučně

source: usage: ./reader.lua [OPTION] ... path
cs_cz: použití: ./reader.lua [VOLBY] ... cesta

source: zoom in
cs_cz: zvětšit

source: zoom out
cs_cz: zmenšit

source: zoom to fit content
cs_cz: zvětšit podle obsahu

source: zoom to fit content height
cs_cz: zvětšit podle obsahu na výšku

source: zoom to fit content width
cs_cz: zvětšit podle obsahu na šířku

source: zoom to fit page
cs_cz: Zvětšit na šířku stránky

source: zoom to fit page height
cs_cz: zvětšit na výšku stránky

source: zoom to fit page width
cs_cz: zvětšit na šířku stránky
